[{"id":12,"title":"Wells Fargo Welcomes $6.7 Million UBS Team in Bellevue: A Strategic Move in Wealth Management","slug":"wells-fargo-welcomes-67-million-ubs-team-in-bellevue-a-strategic-move-in-wealth-management","excerpt":"Wells Fargo recruits a top UBS team, expanding its wealth management prowess in Bellevue.","content":"<p>In a significant development within the financial advisory sector, Wells Fargo Advisors has successfully recruited a high-performing team from UBS Wealth Management USA. This team, known as the Legacy Investment Consulting Group, is based in Bellevue, Washington, and has been instrumental in generating an impressive $6.7 million in annual revenue. The team brings with it the management of $800 million in client assets, further bolstering Wells Fargo's presence in the wealth management arena.</p><p><br></p><h2>The Experienced Team Behind the Success</h2><p>Leading this transition are seasoned advisors Brett T. Williams, Paul Adams, Kyle Kuykendall, and Andrew Dickson, supported by their diligent team members Kevin Tiv, Justin Lewis, and Ann Seidel. Each member brings a wealth of experience and expertise, enhancing Wells Fargo's capabilities in delivering comprehensive financial solutions to its clients.</p><p><br></p><p>Brett Williams, a veteran in the industry, began his career in 1993 and has a rich history of working with prominent financial institutions like Merrill Lynch and UBS. Paul Adams also boasts 27 years of experience, having joined UBS in 2009. Kyle Kuykendall and Andrew Dickson, who have been pivotal in UBS's success, complete the leadership team with their extensive backgrounds in financial advisory services.</p><p><br></p><h2>Industry Shifts and Strategic Moves</h2><p>This move is part of a broader trend of strategic shifts within large wirehouse teams. UBS has recently experienced a noticeable decrease in its broker headcount in the Americas, attributed to changes in advisor compensation and leadership restructuring aimed at improving profitability. Despite these changes, the firm maintains a strong support platform for its advisors, as highlighted by Chief Financial Officer Todd Tuckner.</p><p><br></p><p>Wells Fargo continues to strengthen its position in the market by intensifying its recruitment efforts. The firm has successfully attracted high-revenue teams from various competitors, demonstrating its commitment to expanding its influence in the financial advisory sector. Recent additions include teams from Morgan Stanley and Stifel Nicolaus &amp; Co., further solidifying Wells Fargo's reputation as a formidable player in the industry.</p><p><br></p><h2>A Promising Future in Wealth Management</h2><p>With approximately 12,000 brokers across its diverse channels, Wells Fargo is well-positioned to leverage the expertise of the Legacy Investment Consulting Group to enhance its service offerings. This strategic move not only augments Wells Fargo's capabilities but also reaffirms its dedication to delivering exceptional value to its clients.</p><p>As the financial landscape continues to evolve, such strategic acquisitions are crucial for firms aiming to maintain a competitive edge. The addition of the Legacy Investment Consulting Group to Wells Fargo's roster is a testament to the firm's proactive approach in navigating the complexities of the wealth management industry.</p>","author":"Admin User","category":"moves","tags":"[\"Wells Fargo\"]","featuredImage":"https://arizent.brightspotcdn.com/b9/5d/f426cabd492a9c8cb449a5c061a7/wells-fargo.jpg","published":true,"featured":false,"createdAt":"2025-05-07T00:46:50.856Z","updatedAt":"2025-05-07T00:48:29.182Z","imageUrl":"https://arizent.brightspotcdn.com/b9/5d/f426cabd492a9c8cb449a5c061a7/wells-fargo.jpg","date":"2025-05-07T00:46:50.856Z"},{"id":11,"title":"Houston RIA Welcomes $1.5 Billion Morgan Stanley Team","slug":"houston-ria-welcomes-15-billion-morgan-stanley-team","excerpt":"A $1.5B Morgan Stanley team joins Houston RIA Americana Partners, marking a significant industry shift.","content":"<p>In a significant move within the financial advisory sector, a distinguished team managing $1.5 billion has transitioned from Morgan Stanley to Americana Partners, a Houston-based registered investment advisor (RIA). This strategic shift was officially announced on May 5, 2025.</p><p><br></p><h2>Meet the Team</h2><p>The team, known previously as the AHM Group at Morgan Stanley, is headed by Palmer Moldawer, a financial industry veteran with 37 years of experience. Joining him are esteemed advisors William H. Carsey and J. Will Gutkowski, along with essential support from Kayla Sickman. Their collective expertise is set to bolster Americana Partners' operations.</p><p><br></p><h2>About Americana Partners</h2><p>Founded in 2019 by former Morgan Stanley advisors, Americana Partners has quickly established itself as a formidable presence in the financial advisory landscape. The firm, which is part of the Dynasty Financial Partners network, currently manages $10 billion in assets and operates offices in Austin, Dallas, and Houston.</p><p><br></p><h2>A Strategic Move</h2><p>This move is part of a broader trend of advisors seeking greater autonomy and flexibility by joining RIAs. Americana Partners has been aggressively expanding, recently recruiting another team with $715 million in assets from Morgan Stanley in February 2023.</p><p><br></p><p>While Morgan Stanley remains a dominant player in the industry, with around 15,000 brokers, this transition highlights the growing appeal of RIAs for experienced advisors seeking more tailored client solutions and independence.</p><p>Americana's growth has been further supported by backing from the private equity firm Lovell Minnick Partners since October. This partnership underscores the confidence in Americana Partners' strategic direction and potential for future expansion.</p><h2><br></h2><p>The addition of the AHM Group to Americana Partners is a testament to the dynamic nature of the financial advisory landscape, where advisors are increasingly prioritizing client-centric approaches and operational independence. As the industry evolves, such moves are likely to become more commonplace, reshaping the financial advisory services market.</p>","author":"Admin User","category":"moves","tags":"[]","featuredImage":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ixWxwYlMbswA/v1/-1x-1.webp","published":true,"featured":false,"createdAt":"2025-05-06T22:34:44.423Z","updatedAt":"2025-05-07T00:49:34.181Z","imageUrl":"https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ixWxwYlMbswA/v1/-1x-1.webp","date":"2025-05-06T22:34:44.423Z"},{"id":25,"title":"Navigating Shifts in Wealth Management: Merrill Lynch Faces Significant Advisor Transitions","slug":"navigating-shifts-in-wealth-management-merrill-lynch-faces-significant-advisor-transitions","excerpt":"Merrill Lynch experiences notable advisor transitions, impacting industry dynamics.","content":"<!--publishDate:2025-05-04T04:00:00.000Z-->\n<p>In a dynamic week of transitions, Merrill Lynch, a stalwart in the wealth management industry, has experienced notable shifts in its advisory teams. This series of moves has highlighted the competitive landscape among financial institutions as they vie for top talent and substantial client portfolios.</p><h3><br></h3><h3>Major Departures to Morgan Stanley and Rockefeller</h3><p>A significant loss for Merrill Lynch was the departure of The Sprenkle Stacy Wealth Management Group, a private wealth practice managing $2 billion for 50 institutional retirement plan clients and 350 affluent families. Headed by Christopher L. Sprenkel, a seasoned veteran with over three decades at Merrill, the team generated approximately $6.3 million in annual revenue. Joining Morgan Stanley's private wealth division and its institutional Graystone Consulting unit, they are set to report to Alec S. Ardito, branch manager of the Cincinnati office.</p><p><br></p><p>Further compounding Merrill's losses, two teams managing $1.5 billion in combined assets transitioned to Rockefeller Capital Management in Chicago. The Rathi Wealth Partners and Singh Wealth Partners, responsible for $10 million in combined annual revenue, have shifted their allegiance. Led by Raj Rathi and Kanwar Singh respectively, these teams are now under the guidance of Brett Thelander, director of Rockefeller's Northern Division.</p><h3><br></h3><h3>Merrill Lynch's Strategic Acquisition</h3><p>In a strategic acquisition, Merrill Lynch welcomed Micah G. Scheinberg, an advisor managing $1.9 billion in client assets, from Raymond James’ high-net-worth Alex. Brown unit. Scheinberg, with a career spanning nearly three decades, brings a wealth of experience from prestigious firms like Montgomery Securities, Goldman Sachs, and Deutsche Bank. He will report to Jeff Wood, managing director for Merrill's Mountain West private wealth market.</p><h3><br></h3><h3>Industry Implications and Competitive Dynamics</h3><p>The rapidly changing landscape underscores the fierce competition among leading financial institutions for top-tier advisors and lucrative client accounts. As firms like Morgan Stanley and Rockefeller Capital Management make strategic gains, the pressure mounts on traditional powerhouses like Merrill Lynch to innovate and retain top talent.</p><p>These moves reflect broader trends in the wealth management sector, where institutions are increasingly focused on expanding their reach through strategic talent acquisitions and enhancing their service offerings. As the industry evolves, the ability to attract and retain skilled advisors becomes a critical component of maintaining competitive advantage.</p><p><br></p><p>As the dust settles, it will be intriguing to observe how these shifts influence client experiences and the broader market dynamics in wealth management.</p>","author":"Admin User","category":"advisor-transitions","tags":"[\"Merrill Lynch\",\"Morgan Stanley\",\"Rockefeller Capital Management\"]","featuredImage":"https://colonypark.org/images/property_photos/_xl/Website_large_photo_2-crop.jpg","published":true,"featured":false,"createdAt":"2025-05-07T10:14:40.726Z","updatedAt":"2025-05-07T10:14:40.726Z","imageUrl":"https://colonypark.org/images/property_photos/_xl/Website_large_photo_2-crop.jpg","date":"2025-05-04T04:00:00.000Z"},{"id":26,"title":"The Strategic Return: A $10 Million Merrill Team Rejoins Morgan Stanley","slug":"the-strategic-return-a-10-million-merrill-team-rejoins-morgan-stanley","excerpt":"A high-performing Merrill team returns to Morgan Stanley, reflecting strategic shifts in financial advisory.","content":"<!--publishDate:2025-05-04T04:00:00.000Z-->\n<p>In a significant move within the financial advisory industry, a high-performing Merrill Lynch team has opted to return to its former home at Morgan Stanley. This transition highlights ongoing shifts among major players in the financial advisory world, driven by strategic decisions aimed at optimizing client service and business growth.</p><p><br></p><p>The Rowling Group, led by Keith E. Rowling, has made a noteworthy return to Morgan Stanley after an eight-year stint at Merrill Lynch. Based in West Palm Beach, Florida, the team is renowned for generating at least $10 million in annual revenue, according to <a href=\"https://www.barrons.com/articles/barrons-top-1200-advisors-2025-6e1f2b5\" rel=\"noopener noreferrer\" target=\"_blank\">Barron's ranking</a> of top advisors in 2025. The team, along with advisor Colton M. Creamer from San Antonio, Texas, and client associates Donna Bartelotti, Peter Sandquist, and Tess Morano, managed an impressive $1.9 billion in assets.</p><p><br></p><p>Rowling, who originally joined Merrill from Morgan Stanley in 2017, managed $4.5 billion in assets at that time, serving large family office clients. His return to Morgan Stanley marks a strategic realignment, potentially influenced by the evolving needs of his client base and the firm's robust platform.</p><h2><br></h2><p>The financial advisory industry is no stranger to such high-profile transitions. As noted by <a href=\"https://www.reuters.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Reuters</a>, the movement of top advisors between firms is often driven by the pursuit of better resources and support for their clients. Morgan Stanley’s CEO, Ted Pick, emphasized the firm's proactive recruiting efforts, which have seen increased interest from prospective hires. \"Folks want to come on to this platform,\" Pick stated, highlighting the firm's ability to attract top talent through its comprehensive service offerings.</p><h2><br></h2><p>This move is part of a larger trend of significant advisor transitions. Recent weeks have seen Merrill Lynch acquiring top talent from UBS and Raymond James, while also losing teams to Rockefeller Capital Management and Morgan Stanley. Such movements indicate a competitive landscape where firms are continuously vying for top talent to enhance their client service capabilities.</p><p><br></p><p>According to <em>Financial Advisor Magazine</em>, the ability to provide tailored solutions and robust client support systems are key factors driving these transitions. As advisors seek platforms that align with their professional goals and client needs, firms must adapt to stay competitive.</p><h2><br></h2><p>As the Rowling Group settles back into Morgan Stanley, all eyes will be on how this transition impacts their performance and client relationships. The financial advisory industry continues to evolve, with strategic moves like this shaping the future landscape.</p><p><br></p><p>The high-stakes game of advisor transitions underscores the importance of adaptability and strategic vision in the financial services sector. For advisors and firms alike, these moves are more than just business—they are about finding the right fit to deliver exceptional value to clients.</p>","author":"Admin User","category":"advisor-transitions","tags":"[\"Morgan Stanley\"]","featuredImage":"https://www.amlintelligence.com/wp-content/uploads/2025/02/morgan-stanley-e1741010043422.png","published":true,"featured":false,"createdAt":"2025-05-07T10:29:19.892Z","updatedAt":"2025-05-07T10:29:19.892Z","imageUrl":"https://www.amlintelligence.com/wp-content/uploads/2025/02/morgan-stanley-e1741010043422.png","date":"2025-05-04T04:00:00.000Z"},{"id":10,"title":"Lido and CW Advisors Make Strategic RIA Acquisitions to Expand Their Reach","slug":"lido-and-cw-advisors-make-strategic-ria-acquisitions-to-expand-their-reach","excerpt":"Lido and CW Advisors expand with strategic RIA acquisitions, enhancing regional influence.","content":"<p>May 2025 marks a significant period for both Lido Advisors and CW Advisors as they announce pivotal acquisitions, further extending their influence in the financial advisory landscape. These strategic moves highlight their commitment to expanding regional presence and enhancing client services.</p><p><br></p><h2>Lido Advisors Expands in the Southwest</h2><p>Lido Advisors has forged a new partnership with Copperwynd Financial, a Scottsdale-based RIA managing over $720 million in assets. This acquisition bolsters Lido's presence in the Southwest, adding offices in Arizona and Utah. With this addition, Lido's assets under management soar to over $29 billion.</p><p>Ken Stern, President of Lido Advisors, expressed enthusiasm about the partnership, stating, \"Copperwynd brings a deep dedication to clients and local communities. We're excited to unite our shared values to enhance and expand our wealth management services.\" The collaboration also enriches Lido with a team of multi-generational advisors and additional client service staff.</p><p><br></p><h2>CW Advisors Strengthens Mid-Atlantic Presence</h2><p>Meanwhile, CW Advisors, based in Boston, announced the acquisition of two firms: Wolf Group Capital Advisors in Fairfax, Virginia, and Parsons Capital Management in New Hope, Pennsylvania. These acquisitions bring in a combined $1.4 billion in assets, solidifying CW Advisors' presence in the mid-Atlantic region with now over $13 billion in assets under management across 17 offices nationwide.</p><p>Bob Len, managing director of Wolf Group, emphasized the benefits of the merger, stating, \"The joining of our teams enables us to provide an expanded offering and to leverage the platform to continue to deliver exceptional client service.\" The integration promises to benefit clients significantly by leveraging CW Advisors' extensive resources.</p><p>As both Lido Advisors and CW Advisors continue to grow through strategic acquisitions, their expanded capabilities and resources are set to offer enhanced services to their clients, reinforcing their positions as leading financial advisors.</p>","author":"Admin User","category":"news","tags":"[]","featuredImage":"https://www.potelawfirm.com/img/partnership-formation.jpg","published":true,"featured":false,"createdAt":"2025-05-02T20:08:11.125Z","updatedAt":"2025-05-02T20:08:43.909Z","imageUrl":"https://www.potelawfirm.com/img/partnership-formation.jpg","date":"2025-05-02T20:08:11.125Z"},{"id":5,"title":"Morgan Stanley Team Joins UBS","slug":"morgan-stanley-team-joins-ubs","excerpt":"In a strategic shift within the wealth management landscape, John Harrison and Emily Chen have transitioned from Morgan Stanley to UBS, managing over $600 million in assets. This move underscores the industry's trend towards platforms offering greater autonomy and technological advancements.","content":"<p># Morgan Stanley Team Joins UBS In a significant reshuffle within the wealth management industry, a prominent team from Morgan Stanley has made a strategic transition to UBS. This move, announced on October 10, 2023, involves seasoned financial advisors John Harrison and Emily Chen, who collectively manage over $600 million in client assets. Operating out of Morgan Stanley's New York City office, the team has opted to bring their expertise and clientele to UBS's thriving platform. John Harrison, a veteran in the industry with over 20 years of experience, expressed enthusiasm about the move. 'UBS's commitment to innovation and client-first strategies aligns perfectly with our vision,' Harrison stated. 'We are excited to leverage UBS's robust resources to deliver enhanced value to our clients.' Emily Chen, who has been a rising star in wealth management, added, 'This transition allows us to offer our clients a broader range of solutions and a global perspective that is increasingly important in today's interconnected financial landscape.' The decision to switch firms comes amid a broader trend in the wealth management industry where advisors are seeking platforms that offer greater autonomy, cutting-edge technology, and global reach. According to industry analysts, UBS has been actively investing in technology and expanding its wealth management services, making it an attractive destination for top-tier advisors looking to grow their practices. Tom Naratil, Co-President of UBS Global Wealth Management, welcomed the team with open arms. 'John and Emily bring a wealth of experience and a proven track record of success. We are thrilled to have them join our team and are confident that they will further enhance our client offerings and strengthen our presence in the New York market.' This move is reflective of the increasing mobility within the financial advisory sector, as advisors seek out environments that best support their clients' evolving needs. The shift from Morgan Stanley to UBS underscores the competitive nature of the industry, where firms are constantly vying to attract and retain top talent by offering superior platforms and support. Industry insiders note that this transition is part of a larger trend where advisors are opting for firms that not only offer competitive financial incentives but also prioritize technological advancements and comprehensive client service models. As more clients demand personalized and holistic financial advice, firms like UBS are well-positioned to capture market share by offering a blend of traditional wealth management services with innovative financial solutions. In conclusion, the move by John Harrison and Emily Chen from Morgan Stanley to UBS highlights the dynamic nature of the wealth management industry. As advisors continue to seek environments that promote growth and client satisfaction, firms that can adapt to these demands are likely to emerge as leaders in the space. --- *Source: Financial Advisor News*</p>","author":"News Team","category":"moves","tags":"[\"News\",\"Advisor Moves\"]","featuredImage":"https://imageio.forbes.com/specials-images/imageserve/64d5b76e473efabe9b0ed9f8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","published":true,"featured":false,"createdAt":"2025-05-02T14:45:08.080Z","updatedAt":"2025-05-02T14:52:36.085Z","imageUrl":"https://imageio.forbes.com/specials-images/imageserve/64d5b76e473efabe9b0ed9f8/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds","date":"2025-05-02T14:45:08.080Z"},{"id":19,"title":"AdvicePay Acquires AdvisorBOB to Enhance Compensation Tech for Financial Advisors","slug":"advicepay-acquires-advisorbob-to-enhance-compensation-tech-for-financial-advisors","excerpt":"AdvicePay acquires AdvisorBOB to streamline advisory compensation processes and enhance financial services.","content":"<!--publishDate:2025-05-01T04:00:00.000Z-->\n<p>In a strategic move to deepen its capabilities in the financial advisory sector, AdvicePay, a leader in advisor billing and payments technology, has announced its acquisition of AdvisorBOB. This acquisition marks a pivotal step for AdvicePay, aiming to streamline compensation processes and extend its reach across the entire revenue lifecycle of advisory firms.</p><h2><br></h2><h2>Enhancing Advisory Capabilities</h2><p>AdvisorBOB, known for its innovative advisor compensation software, automates the complex processes of compensation calculations and payout tracking. This allows advisory firms to move away from cumbersome spreadsheets, ensuring precision and efficiency in advisor payments. The integration of AdvisorBOB's technology is set to enhance AdvicePay's existing offerings, providing a comprehensive solution that goes beyond client billing to encompass advisor payouts as well.</p><h2><br></h2><h2>Leadership Perspectives</h2><p>Alan Moore, co-founder and CEO of AdvicePay, expressed his enthusiasm about the acquisition, stating, \"AdvicePay was established to address the challenges around billing and compliance in fee-for-service financial planning. Expanding into compensation technology is a natural progression of our mission.\" This strategic acquisition reflects the growing trend towards fee-based advisory models, as highlighted by recent Cerulli research projecting that by 2026, advisory fees will constitute at least 90% of revenue for over half of financial advisors.</p><h2><br></h2><h2>Market Position and Future Plans</h2><p>AdvicePay has cemented its status as a leading provider in the advisor billing market, capturing a significant market share according to the latest T3/Inside Information Advisor Tech survey. The survey also recognized AdvisorBOB, giving it an honorable mention among top billing and payment tech firms. The acquisition, completed without external funding, highlights AdvicePay's strong financial position and strategic approach to growth.</p><h2><br></h2><h2>What Lies Ahead</h2><p>The AdvisorBOB team, including CEO Colton Pence, will continue to operate from their Berwyn, Pennsylvania office, maintaining AdvisorBOB as a standalone product. This decision ensures that both companies can continue to serve their clients independently while leaving the possibility of integrating their capabilities open as demand for comprehensive billing and payout solutions increases.</p><p>This acquisition signifies a new chapter for both companies, promising enhanced services for financial advisors and a more streamlined approach to managing the full revenue cycle of advisory firms.</p>","author":"Admin User","category":"industry-trends","tags":"[]","featuredImage":"https://www.smartosc.com/wp-content/uploads/2023/12/fintech-service-e1703592968417.png","published":true,"featured":false,"createdAt":"2025-05-07T09:34:18.648Z","updatedAt":"2025-05-07T09:34:18.648Z","imageUrl":"https://www.smartosc.com/wp-content/uploads/2023/12/fintech-service-e1703592968417.png","date":"2025-05-01T04:00:00.000Z"},{"id":18,"title":"Empowering Financial Advisors with eMoney's Enhanced Needs Analysis Tool","slug":"empowering-financial-advisors-with-emoneys-enhanced-needs-analysis-tool","excerpt":"Discover how eMoney's enhanced tool helps advisors engage clients with focused, goal-based financial planning.","content":"<!--publishDate:2025-04-30T04:00:00.000Z-->\n<p>In the ever-evolving world of financial advisory services, staying ahead of client needs is paramount. eMoney Advisor, under the ownership of Fidelity, has once again demonstrated its commitment to innovation with the release of its updated Needs Analysis feature. This tool is designed to revolutionize how financial advisors engage with both mass market and mass affluent clients by facilitating focused, single-goal financial discussions.</p><h2><br></h2><h2>A Streamlined Approach to Financial Planning</h2><p>The newly enhanced Needs Analysis tool is a lightweight planning solution that prioritizes core financial topics, including retirement, education, and spending goals. With a user-friendly workflow, it guides advisors seamlessly from data entry to the generation of actionable deliverables. This streamlined approach ensures that financial professionals can efficiently address the unique concerns and aspirations of their clients.</p><h2><br></h2><h2>Real-Time Dynamic Outputs</h2><p>One of the standout features of this updated tool is its ability to provide dynamic outputs that respond in real-time as data is entered. This capability allows advisors to present clients with up-to-date and relevant insights, fostering a more engaging and personalized discussion. Additionally, summary reports highlight key metrics across various planning modules, providing a comprehensive view of the client's financial landscape.</p><h2><br></h2><h2>Meeting Clients Where They Are</h2><p>Chad Porche, Senior Vice President of Product Management at eMoney, emphasizes the importance of tailoring financial advice to the individual needs of clients. \"Many people are interested in receiving financial advice but only want to discuss goals that are most relevant to them and their situation,\" he states. This tool aligns perfectly with that philosophy, enabling advisors to offer targeted advice without overwhelming clients with unnecessary information.</p><h2><br></h2><h2>Opportunities for Deeper Client Engagement</h2><p>Research by Cerulli highlights that 83% of financial advisors view the potential for stronger client relationships as a key advantage of providing planning services. However, 15% note that their clients either lack the time or the inclination to engage deeply in the planning process. eMoney's tool addresses this gap by offering a focused, efficient solution that can lead to deeper engagement as clients' needs grow more complex.</p><h2><br></h2><h2>Expanding Horizons for Financial Advisors</h2><p>eMoney remains committed to expanding the capabilities of the Needs Analysis tool. Future updates will introduce additional goal-based topics, including life insurance, annuity income, long-term care, and debt reduction. These enhancements will empower advisors to address a broader range of client concerns, further solidifying eMoney's position as a leader in the financial planning software space.</p><h2><br></h2><h2>A Proven Leader in Financial Planning Software</h2><p>Since its acquisition by Fidelity nearly a decade ago, eMoney has consistently been recognized as a leader in financial planning software. According to the T3/Inside Information 2025 Software Survey, eMoney commands a market share of 28.2%, surpassing competitors like MoneyGuidePro and RightCapital. This dominance is even more pronounced among larger advisory firms, where eMoney holds a 45.57% market share among firms with revenues exceeding $8 million.</p><p><br></p><p>As the financial advisory landscape continues to evolve, tools like eMoney's Needs Analysis are essential for advisors seeking to build stronger, more meaningful relationships with their clients. By focusing on targeted, goal-based planning, advisors can deliver the personalized insights clients seek, enhancing their service offerings and driving growth.</p>","author":"Admin User","category":"industry-trends","tags":"[]","featuredImage":"https://psplab.com/wp-content/uploads/2020/09/What-is-e-money.jpg","published":true,"featured":false,"createdAt":"2025-05-07T09:32:27.718Z","updatedAt":"2025-05-07T09:32:27.718Z","imageUrl":"https://psplab.com/wp-content/uploads/2020/09/What-is-e-money.jpg","date":"2025-04-30T04:00:00.000Z"},{"id":24,"title":"RBC's Strategic Acquisition: A Deep Dive into Their $5 Billion Win from J.P. Morgan","slug":"rbcs-strategic-acquisition-a-deep-dive-into-their-5-billion-win-from-jp-morgan","excerpt":"RBC Wealth Management scores a $5 billion team from J.P. Morgan, marking a strategic industry shift.","content":"<!--publishDate:2025-04-30T04:00:00.000Z-->\n<p>The financial industry has been buzzing with the recent news of RBC Wealth Management-U.S. successfully acquiring a significant team from J.P. Morgan Advisors. The move, confirmed by an RBC spokesperson, marks one of the largest hires for RBC in recent memory. This strategic acquisition involves the Degenaars Babb Group, a team managing an impressive $5 billion in assets based in New York City.</p><p><br></p><h3>Who Are the Degenaars Babb Group?</h3><p>Led by seasoned advisors Glenn S. Degenaars and Jason L. Babb, the group brings a wealth of experience to RBC. Degenaars and Babb, both with over 16 years in the industry, transitioned to J.P. Morgan in May 2023 following the bank's acquisition of First Republic. The team is further strengthened by advisor Kristin J. Ashman and a robust support staff of eight.</p><blockquote>\"This team’s extensive research has led them to conclude that RBC Wealth Management is the best firm to serve their high-net-worth and ultra-high-net-worth clients,\" stated John Moran, RBC's New York complex director.</blockquote><h3><br></h3><h3>The Context Behind the Transition</h3><p>This move comes on the heels of a broader trend of transitions within the industry, especially post the tax season rush. Another notable shift involved a former First Republic team managing $700 million, who left J.P. Morgan for Citizens Financial Group in New Jersey.</p><p>First Republic's collapse in March 2023, exacerbated by fears of deposit outflows amid rising interest rates, led to a significant number of advisor departures. Prior to its challenges, First Republic was favored for its smaller, less bureaucratic environment, attracting many wirehouse brokers.</p><h3><br></h3><h3>The Bigger Picture</h3><p>RBC's aggressive recruitment strategy appears to be paying off. As of January, RBC's 2,200 brokers were managing a staggering $667 billion in assets. This recent acquisition is expected to further bolster their position in the competitive wealth management market.</p><p>While J.P. Morgan has maintained that they have stabilized post-First Republic acquisition, retaining approximately 75% of advisors and clients, the departure of high-profile teams such as Degenaars Babb indicates ongoing challenges.</p><h3><br></h3><h3>The Future of Advisor Transitions</h3><p>As the wealth management landscape continues to evolve, advisor transitions like these are becoming increasingly common. With firms constantly vying for top talent, the dynamics of such moves often involve complex negotiations and strategic planning.</p><p><br></p><p>For RBC, the integration of the Degenaars Babb Group is not just a win in terms of assets under management but also a reinforcement of their commitment to providing top-tier service to high-net-worth clients.</p><p>As the industry continues to navigate post-pandemic shifts and economic uncertainties, such strategic moves underscore the importance of adaptability and foresight in maintaining a competitive edge.</p>","author":"Admin User","category":"advisor-transitions","tags":"[\"RBC\",\"J.P. Morgan\"]","featuredImage":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/02/rbc-0227-np--1.jpg","published":true,"featured":false,"createdAt":"2025-05-07T10:12:06.210Z","updatedAt":"2025-05-07T10:12:06.210Z","imageUrl":"https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2025/02/rbc-0227-np--1.jpg","date":"2025-04-30T04:00:00.000Z"},{"id":17,"title":"How Financial Advisors Leverage Technology Amid Economic Uncertainty","slug":"how-financial-advisors-leverage-technology-amid-economic-uncertainty","excerpt":"Discover how financial advisors use technology to provide stability amid economic uncertainty.","content":"<!--publishDate:2025-04-29T04:00:00.000Z-->\n<p>In recent months, financial advisors have increasingly turned to technology to navigate the complexities of a volatile market environment. With the reintroduction of tariffs by President Donald Trump during his second term in office, the financial landscape has experienced significant upheaval. This has prompted advisors to adopt innovative tech solutions to provide their clients with stability and confidence.</p><p><br></p><h2>Understanding the Economic Landscape</h2><p>Since the start of 2025, we have witnessed a dramatic shift in economic sentiment. The University of Michigan's consumer sentiment index dropped to 50.8 points in April, a notable decline from 77.2 points the previous year. The ongoing trade tensions have further exacerbated these concerns, with a significant number of investors expressing bearish sentiments on the stock market's short-term prospects.</p><h2><br></h2><h2>Technological Tools in Financial Advisory</h2><p>Amidst this economic volatility, financial advisors are utilizing tech-driven tools to reassure their clients. For instance, Kelly Renner from Life Strategies Financial Partners relies on eMoney for comprehensive financial planning. This software allows advisors to assess potential impacts on client portfolios swiftly, offering reassurance even in a downturn.</p><p><br></p><p>Similarly, Timothy Ralph of Merit Financial Advisors emphasizes the importance of Holistiplan for active tax management. This tool helps advisors understand the tax implications of client decisions, such as selling concentrated stocks or rebalancing portfolios. By using these platforms, advisors can provide personalized advice that aligns with their clients' financial goals.</p><h2><br></h2><h2>Strategic Tax Planning</h2><p>Michael Dunham at Fontana Financial Planning highlights the strategic use of FP Alpha in optimizing tax strategies, particularly during market downturns. By analyzing clients’ tax returns, advisors can identify opportunities for Roth conversions and tax-loss harvesting, ensuring long-term financial health.</p><h2><br></h2><p>As we continue to navigate these uncertain economic waters, the integration of technology into financial advisory practices is proving indispensable. By embracing these tools, advisors not only enhance their service offerings but also fortify the trust and confidence of their clients. As the financial landscape evolves, technology will remain a critical ally in ensuring sound financial planning and stability.</p>","author":"Admin User","category":"news","tags":"[]","featuredImage":"https://d1qfwzw6aggd4h.cloudfront.net/background-images/_bannerImage/Trump-Tariffs_1200x800_v.2.png","published":true,"featured":false,"createdAt":"2025-05-07T09:31:21.518Z","updatedAt":"2025-05-07T09:31:21.518Z","imageUrl":"https://d1qfwzw6aggd4h.cloudfront.net/background-images/_bannerImage/Trump-Tariffs_1200x800_v.2.png","date":"2025-04-29T04:00:00.000Z"},{"id":16,"title":"Raymond James Revolutionizes Financial Advisory Services with AI Innovation","slug":"raymond-james-revolutionizes-financial-advisory-services-with-ai-innovation","excerpt":"Raymond James launches AI tool to enhance advisory services, boosting efficiency and data access.","content":"<!--publishDate:2025-04-27T04:00:00.000Z-->\n<p>In a bold move to enhance service delivery and efficiency, Raymond James has unveiled its proprietary generative AI platform, AI Search. This innovative tool is set to transform how financial advisors and associates access and utilize vast data resources within the firm.</p><h2><br></h2><h2>Empowering Advisors with AI-Driven Insights</h2><p>The introduction of AI Search marks a significant step in Raymond James' broader strategy to integrate artificial intelligence into its operations. Designed to respond to natural-language queries, this tool provides precise answers from the company's extensive internal knowledge base, thereby streamlining the information retrieval process for advisors.</p><h2><br></h2><h2>Seamless Integration and User Feedback</h2><p>AI Search is seamlessly embedded into the existing systems that advisors already use, ensuring a smooth transition without the need for adopting new platforms. According to Stuart Feld, Chief Artificial Intelligence Officer at Raymond James, the tool minimizes the time advisors spend sifting through search results, offering a direct question-and-answer experience that leads them to the right information or contact promptly.</p><p>The platform incorporates built-in feedback mechanisms, allowing users to rate the quality of responses. This real-time feedback is crucial for continuous improvement and refinement of the tool, addressing any potential limitations of AI models.</p><h2><br></h2><h2>Commitment to Innovation and Security</h2><p>Raymond James is committed to innovation in financial services, investing approximately $975 million annually into technology enhancements. The firm collaborates closely with financial advisors during technology design, ensuring developments align with the practical needs of the industry.</p><p>Beyond service delivery, the AI initiatives extend to cybersecurity and fraud prevention, where machine learning algorithms enhance threat detection and support anti-money laundering functions. This multifaceted approach underscores the firm's dedication to maintaining secure, scalable, and efficient operations.</p><h2><br></h2><h2>The Future of AI in Financial Advisory</h2><p>As the financial sector increasingly embraces AI technology, Raymond James remains at the forefront, driven by a Technology Advisory Council composed of seasoned advisors. A recent survey by Fuse Research Network indicates a growing interest in AI among advisors, with 82 percent planning investments in AI tools in the coming years.</p><p>\"While AI integration is still in its early stages, we foresee its pivotal role in boosting efficiency, personalization, and decision-making in financial advisory services,\" said Mike Evans, director of advisor and benchmark research at Fuse Research.</p><p>Raymond James' AI Search is a testament to the firm's commitment to innovation and its vision for the future of financial advisory services, setting a new standard for the industry.</p>","author":"Admin User","category":"industry-trends","tags":"[]","featuredImage":"https://www.rws.com/media/images/scs-ai-new-img-hero-1920x1080b-03_tcm228-261952.webp?v=20250428120412","published":true,"featured":false,"createdAt":"2025-05-07T09:29:49.075Z","updatedAt":"2025-05-07T09:29:49.075Z","imageUrl":"https://www.rws.com/media/images/scs-ai-new-img-hero-1920x1080b-03_tcm228-261952.webp?v=20250428120412","date":"2025-04-27T04:00:00.000Z"},{"id":15,"title":"Nordwand Capital Strengthens Leadership with the Appointment of Patrick McGinnis","slug":"exploring-vanguards-strategic-moves-amid-market-challenges","excerpt":"Nordwand Capital hires Patrick McGinnis to enhance client services and expand multigenerational planning.","content":"<!--publishDate:2025-04-26T04:00:00.000Z-->\n<p>In a strategic move to bolster its client services, <strong>Nordwand Capital</strong>, a multifamily office part of the <em>Dynasty Financial Partners</em> network, has announced the addition of <strong>Patrick McGinnis Jr.</strong> as Managing Director and Financial Advisor. With a robust portfolio of $4 billion in assets under management, the Radnor, Pennsylvania-based firm is enhancing its offerings to accommodate complex client needs.</p><h2><br></h2><h2>Expanding Multigenerational Planning and Investment Management</h2><p>McGinnis, who brings a wealth of experience from his previous role at <em>Fiduciary Trust</em>, where he oversaw $300 million in client assets, is set to play a pivotal role in Nordwand’s growth strategy. His expertise in equity portfolio management and estate planning is expected to complement Nordwand's vision of deepening relationships with high-net-worth families. At Fiduciary Trust, McGinnis was instrumental in developing comprehensive strategies for wealthy clients, focusing on multigenerational wealth transfer and investment optimization.</p><h2><br></h2><h2>A Perfect Alignment of Experience and Vision</h2><p>Jim Martin, CEO of Nordwand Capital, expressed his enthusiasm about McGinnis joining the firm, noting, \"Pat's in-depth knowledge and client-first approach are perfectly aligned with our mission to deliver tailored solutions.\" McGinnis’ extensive experience aligns seamlessly with Nordwand’s commitment to offering a wide array of services without compromising profitability, a balance that many in the wealth management sector strive to achieve.</p><h2><br></h2><h2>Strengthening In-House Capabilities</h2><p>With McGinnis on board, Nordwand Capital now boasts five senior advisors, enhancing its capacity to address the sophisticated needs of families seeking advanced investment and estate planning solutions. Ted Brooks, Chief Investment Strategist at Nordwand, highlighted the cultural fit between McGinnis and the firm, emphasizing his independence and client-centric approach.</p><h2><br></h2><h2>A History of Strategic Growth</h2><p>Nordwand Capital’s journey began under the leadership of Jim Martin, who transitioned from a long career in the wirehouse channel to establishing Nordwand as a premier independent advisory firm in 2022. His move was described by industry expert David Devoe as one of the largest breakaways in recent years, marking a shift towards more personalized, client-focused wealth management services.</p><p>As Nordwand Capital continues to evolve, the addition of Patrick McGinnis marks another significant step in its mission to provide unparalleled service to ultra-high-net-worth clients.</p>","author":"Admin User","category":"moves","tags":"[\"Dynasty\"]","featuredImage":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1299881295/image_1299881295.jpg?io=getty-c-w750","published":true,"featured":false,"createdAt":"2025-05-07T09:15:45.969Z","updatedAt":"2025-05-07T09:25:01.634Z","imageUrl":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1299881295/image_1299881295.jpg?io=getty-c-w750","date":"2025-04-26T04:00:00.000Z"},{"id":14,"title":"BlackRock's Strategic Board Appointments Signal Focus on Wealth Management","slug":"blackrocks-strategic-board-appointments-signal-focus-on-wealth-management","excerpt":"BlackRock welcomes Kathleen Murphy and Greg Fleming, signaling a focus on wealth management.","content":"<!--publishDate:2025-04-23T04:00:00.000Z-->\n<p>In a move that has captured the attention of the financial world, BlackRock, the global investment management behemoth, has recently welcomed two notable figures to its board: Kathleen Murphy, former retail powerhouse at Fidelity, and Greg Fleming, the ex-retail chief of Morgan Stanley. This development has sparked discussions and speculation about BlackRock CEO Larry Fink's intentions to delve deeper into the wealth management sector.</p><h2><br></h2><h2>The New Additions: Who Are They?</h2><p><strong>Kathleen Murphy</strong> has long been recognized as a trailblazer in retail finance, having significantly contributed to Fidelity's success in engaging individual investors. Her expertise could prove invaluable to BlackRock as it seeks to enhance its presence in the retail investing space.</p><p><strong>Greg Fleming</strong> comes with a wealth of experience from Morgan Stanley, where he played a pivotal role in retail operations. His strategic insights and leadership could help BlackRock navigate the complexities of wealth management.</p><h2><br></h2><h2>Why Is This Significant?</h2><p>The addition of Murphy and Fleming is more than just a routine board reshuffle. It suggests a strategic pivot for BlackRock, as the firm potentially aims to strengthen its foothold in the wealth management channel. With the rising popularity of iShares and the robust capabilities of Aladdin, BlackRock's proprietary risk management system, the firm appears poised to leverage these assets to capture more of the retail market.</p><h2><br></h2><h2>The Bigger Picture: BlackRock's Ambitions</h2><p>BlackRock's latest moves come amidst a landscape where financial giants are constantly adapting to new market demands. From environmental, social, and governance (ESG) investing to the increasing importance of digital platforms, the wealth management industry is evolving rapidly. By bringing on board seasoned veterans like Murphy and Fleming, BlackRock positions itself to not only adapt but potentially lead in this dynamic environment.</p><h2><br></h2><p>As BlackRock continues to make strategic decisions, the industry watches closely. The appointments of Kathleen Murphy and Greg Fleming could be instrumental in shaping BlackRock's future strategy, particularly in the wealth management sector. Investors and financial professionals alike will be keen to see how these additions influence the firm's direction in the coming months.</p>","author":"Admin User","category":"industry-trends","tags":"[]","featuredImage":"https://imgproxy.divecdn.com/YHaTy7z_vDiLRh9Z7iaa2JsJ8yVmvLq7Op8y5hYcG_U/g:ce/rs:fill:1200:675:1/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9HZXR0eUltYWdlcy00NjI5ODA4MDMuanBn.webp","published":true,"featured":false,"createdAt":"2025-05-07T01:52:00.965Z","updatedAt":"2025-05-07T09:04:21.286Z","imageUrl":"https://imgproxy.divecdn.com/YHaTy7z_vDiLRh9Z7iaa2JsJ8yVmvLq7Op8y5hYcG_U/g:ce/rs:fill:1200:675:1/Z3M6Ly9kaXZlc2l0ZS1zdG9yYWdlL2RpdmVpbWFnZS9HZXR0eUltYWdlcy00NjI5ODA4MDMuanBn.webp","date":"2025-04-23T04:00:00.000Z"},{"id":23,"title":"Citizens Financial Group Expands with New $700 Million Advisory Team","slug":"citizens-financial-group-expands-with-new-700-million-advisory-team","excerpt":"Citizens Financial Group hires a new advisory team managing $700 million, boosting its wealth management division.","content":"<!--publishDate:2025-04-18T04:00:00.000Z-->\n<p>In an exciting development for Citizens Financial Group, the company has successfully recruited a high-profile advisory team that previously managed $700 million in assets at J.P. Morgan Advisors. This strategic addition is part of Citizens' ongoing commitment to enhancing its wealth management services, particularly in the Tri-State Metro area.</p><h2><br></h2><h2>Meet the New Team</h2><p>The team, based in Bergen County, New Jersey, includes seasoned veterans Kieran J. Lynch, Jack Inserra, and Craig Kaufman. With decades of combined experience in the financial industry, they bring a wealth of expertise and a strong client base to Citizens Private Wealth Management. Previously part of First Republic, their move to Citizens marks a significant step in the firm's growth strategy.</p><h2><br></h2><h2>A Controversial Departure</h2><p>Kieran J. Lynch, the co-leader of the team and a 33-year industry veteran, left J.P. Morgan under challenging circumstances. His departure was linked to a comment made in frustration, interpreted as a violation of J.P. Morgan's “violence-free workplace policy.” Despite the controversy, Citizens Financial Group thoroughly vetted the team and expressed full confidence in their abilities to serve clients effectively.</p><h2><br></h2><h2>Citizens' Confidence in New Hires</h2><p>Tom Metzger, who took the helm of Citizens' private wealth unit in early 2024, expressed enthusiasm about the new additions. “We are thrilled to welcome such a talented team to our ranks. Their expertise will enhance our ability to deliver comprehensive financial solutions to our clients,” said Metzger.</p><h2><br></h2><h2>Growth and Expansion</h2><p>Citizens Financial Group has been on an upward trajectory, actively expanding its wealth management division. Since 2023, the company has brought in around 250 relationship managers from First Republic, aiming to replicate a successful client referral model. The addition of Lynch, Inserra, and Kaufman is a testament to Citizens' dedication to growth and its ability to attract top talent.</p><p><br></p><p>In the past year alone, Citizens Private Wealth has welcomed at least six teams managing a collective $9 billion in assets. This ambitious expansion underscores Citizens' commitment to offering integrated and tailored financial solutions to its diverse client base.</p><h2><br></h2><p>As Citizens Financial Group continues to bolster its wealth management capabilities, the latest recruits are poised to play a crucial role in the firm's future success. With their extensive experience and proven track record, Lynch, Inserra, and Kaufman are set to make a significant impact, helping clients navigate the complexities of wealth management with confidence.</p>","author":"Admin User","category":"moves","tags":"[]","featuredImage":"https://external-preview.redd.it/citizens-bank-working-to-fix-issue-causing-customers-v0-Ha9fqRr7zaZTGHe_4XucrzVUqNDTmNS7lahc6_5WDwA.jpg?width=1080&crop=smart&auto=webp&s=e554942b9928c385477620e92f1b37a250662951","published":true,"featured":false,"createdAt":"2025-05-07T10:02:46.797Z","updatedAt":"2025-05-07T10:02:46.797Z","imageUrl":"https://external-preview.redd.it/citizens-bank-working-to-fix-issue-causing-customers-v0-Ha9fqRr7zaZTGHe_4XucrzVUqNDTmNS7lahc6_5WDwA.jpg?width=1080&crop=smart&auto=webp&s=e554942b9928c385477620e92f1b37a250662951","date":"2025-04-18T04:00:00.000Z"},{"id":21,"title":"Stifel Strengthens Its Ranks with Two Major Merrill Teams in Dallas","slug":"stifel-strengthens-its-ranks-with-two-major-merrill-teams-in-dallas","excerpt":"Stifel recruits two major Merrill wealth teams in Dallas, managing $3B in assets, boosting its Texas presence.","content":"<!--publishDate:2025-04-16T04:00:00.000Z-->\n<p>In a significant move that highlights its growing influence in the financial sector, Stifel Financial has successfully recruited two powerhouse teams from Merrill Lynch's private wealth unit in Dallas. Combined, these teams manage close to $3 billion in client assets. This strategic acquisition is a testament to Stifel's commitment to enhancing its presence in the competitive Texas market.</p><h2><br></h2><p>The teams are led by seasoned industry veterans Melissa Transier and Christopher W. Green, who have a combined experience of several decades in wealth management. They were responsible for overseeing $1.5 billion in assets. Joining them is Ryan Bell, a solo practitioner who managed $1.4 billion. Accompanying these leaders are their trusted client associates: Deborah Griffith, Laura Martin-Bernard, and Stacey Jacobson.</p><p>“We are thrilled to join Stifel, a firm that prioritizes clients and offers a streamlined structure to better serve our high-net-worth clients,” Transier said, expressing enthusiasm about the transition.</p><h2><br></h2><p>The decision to move was influenced by the leadership of Robert A. “Bob” Johnson and Jeffrey Markham. Johnson, who joined Stifel in 2018, has played a pivotal role in strengthening Stifel’s foothold in Texas. His familiarity with the teams and his transition to vice chairman last year provided a seamless pathway for Transier and Green to join Stifel.</p><p>According to sources, the teams conducted extensive due diligence over six months before making the move. Their decision was swayed by the accessibility to local management and the firm's executives, analysts, and investment bankers.</p><h2><br></h2><p>Melissa Transier began her career at JPMorgan Chase &amp; Co. in 1998, with stints at Credit Suisse and Smith Barney before joining Merrill in 2009. Christopher Green started his journey at Donaldson, Lufkin &amp; Jenrette Securities in 1997, following a similar path to Transier. Meanwhile, Ryan Bell, with 26 years in the industry, transitioned from Goldman Sachs to Merrill in 2003.</p><h2><br></h2><p>Stifel's recent hires are part of a larger strategy to bolster its talent pool amid a highly competitive recruiting environment. Despite a slight 2% decrease in its broker headcount to around 2,300 at the end of 2024, Stifel continues to attract top talent, as evidenced by its recent acquisition of a team from Raymond James Financial.</p><p>Stifel CEO Ron Kruszewski acknowledged the challenges of the current recruiting landscape but remains steadfast in maintaining the firm's competitive edge without immediately increasing recruiting offers.</p><h2><br></h2><p>This latest development underscores Stifel's aggressive strategy to strengthen its position in the wealth management industry. As large teams continue to seek new opportunities, Stifel's client-first approach and strong leadership make it an attractive destination for top talent.</p>","author":"Admin User","category":"moves","tags":"[\"Stifel\"]","featuredImage":"https://arizent.brightspotcdn.com/dims4/default/8c7cc9e/2147483647/strip/true/crop/3639x2426+0+0/resize/740x493!/quality/90/?url=https%3A%2F%2Fsource-media-brightspot.s3.us-east-1.amazonaws.com%2F1c%2F4a%2F5e5c76f24705b8e95d297d2e4c1f%2Fadobestock-501175490-editorial-use-only.jpeg","published":true,"featured":false,"createdAt":"2025-05-07T09:57:19.929Z","updatedAt":"2025-05-07T09:57:19.929Z","imageUrl":"https://arizent.brightspotcdn.com/dims4/default/8c7cc9e/2147483647/strip/true/crop/3639x2426+0+0/resize/740x493!/quality/90/?url=https%3A%2F%2Fsource-media-brightspot.s3.us-east-1.amazonaws.com%2F1c%2F4a%2F5e5c76f24705b8e95d297d2e4c1f%2Fadobestock-501175490-editorial-use-only.jpeg","date":"2025-04-16T04:00:00.000Z"},{"id":22,"title":"Rockefeller Expands: Welcomes $10 Million UBS Team in New Jersey","slug":"rockefeller-expands-welcomes-10-million-ubs-team-in-new-jersey","excerpt":"Rockefeller expands with $10M UBS team, enhancing its New Jersey presence.","content":"<!--publishDate:2025-04-16T04:00:00.000Z-->\n<p>In a strategic move following the tax season, Rockefeller Capital Management has successfully attracted a prominent team from UBS Wealth Management USA, significantly enhancing its foothold in New Jersey. This noteworthy transition took place on Wednesday and involves a team responsible for generating $10 million in annual revenue.</p><h2><br></h2><p>The team, based in Florham Park, New Jersey, is led by industry veterans Raymond L. Chase, Angeline E. Newman, and Daniel Riordan III. Collectively, they manage an impressive $1.2 billion in assets. Their move to Rockefeller, along with support staff including Nikki Chhabria, Eric Schenk, Julianne Rose, Jack Worth, and Julia Chase, underscores Rockefeller's growth strategy in the competitive wealth management sector.</p><h2><br></h2><p>Michael Outlaw, Rockefeller’s Head of Growth and New York Metro Divisional Director, expressed enthusiasm about the acquisition, stating, \"We are pleased to welcome our first team in Florham Park, which represents a compelling growth opportunity for the firm.\" This move is part of Rockefeller's broader expansion strategy, driven by its commitment to providing outstanding service and expertise to its clients.</p><p><br></p><p>Raymond L. Chase, a seasoned financial advisor, began his career at Lehman Brothers in 1987, later moving to Merrill Lynch in 1996, and then joining UBS in 2012. Angeline E. Newman, with nearly 40 years in the financial industry, commenced her career at Lehman in 1985, navigating through various mergers before joining Merrill in 2005. Daniel Riordan III started his career at PFS Investments in 2003 and also had a stint at Merrill before his time at UBS.</p><p><br></p><p>This move by Rockefeller coincides with a broader trend of financial advisors transitioning between firms post-tax season. UBS has experienced notable attrition following recent pay plan changes, reflecting a shift in the wealth management landscape. Rockefeller, with its roots in the 2018 recapitalization of the Rockefeller family office, continues to be a formidable player, having expanded to over 170 teams nationwide.</p><p>In parallel with this development, other significant transitions are occurring in the industry. Notably, two large Merrill private wealth teams have joined Stifel in Dallas, each managing over $1 billion in assets, signaling continued dynamism in financial advisor movements.</p>","author":"Admin User","category":"industry-trends","tags":"[]","featuredImage":"https://s3-prod.crainsnewyork.com/336641531_1-16.jpg","published":true,"featured":false,"createdAt":"2025-05-07T09:58:53.033Z","updatedAt":"2025-05-07T09:58:53.033Z","imageUrl":"https://s3-prod.crainsnewyork.com/336641531_1-16.jpg","date":"2025-04-16T04:00:00.000Z"},{"id":20,"title":"Morgan Stanley Welcomes Key Team from JPMorgan, Faces Departure to Wells Fargo","slug":"morgan-stanley-welcomes-key-team-from-jpmorgan-faces-departure-to-wells-fargo","excerpt":"Morgan Stanley gains a key team from JPMorgan, as a top broker moves to Wells Fargo.","content":"<!--publishDate:2025-04-10T04:00:00.000Z-->\n<p>In a significant shift within the financial advisory landscape, Morgan Stanley recently acquired a prominent wealth management team from JPMorgan Chase, while simultaneously experiencing the departure of a major asset manager to Wells Fargo Advisors. These moves highlight the dynamic nature of the financial sector and the ongoing competition for top talent among leading firms.</p><h2><br></h2><h2>Briese Group Joins Morgan Stanley</h2><p>On April 4, Morgan Stanley strengthened its New York City-based private wealth division by bringing on board the Briese Group from JPMorgan Chase. Led by Michael C. Briese, the team managed an impressive $875 million in assets. Briese, who began his career with JPMorgan as a personal banker in 2007, was previously a bank-based private client advisor. His team consists of four junior brokers and a client associate, all of whom are now part of Morgan Stanley’s extensive East 52nd Street branch.</p><p><br></p><p>The transition is noteworthy, as JPMorgan Chase Private Client advisors typically operate within bank branches, focusing on mass affluent customers. In contrast, Morgan Stanley’s Private Wealth division caters to clients with a minimum of $10 million in assets. A recruiter, speaking anonymously, suggested that Briese’s move might be driven by the needs of high-end clients requiring Morgan Stanley’s specialized services.</p><h2><br></h2><h2>JPMorgan’s Response and Legal Challenges</h2><p>JPMorgan Chase has a history of legal actions to retain client relationships when advisors depart. The bank asserts ownership of clients referred from its branches and has pursued temporary restraining orders against departing brokers. This year alone, JPMorgan has taken steps to prevent solicitation of its clients by former advisors who joined competitors, including Morgan Stanley and Wells Fargo.</p><h2><br></h2><h2>Brandon Gioia Transitions to Wells Fargo</h2><p>Meanwhile, Morgan Stanley witnessed the exit of Brandon M. Gioia, a seasoned broker who managed $270 million in assets, to Wells Fargo Advisors in Paramus, New Jersey. Gioia, who began his career with Merrill Lynch, had spent 25 years in the industry. His decision to join Wells Fargo was influenced by the prospect of becoming an independent broker within its Financial Network channel. According to sources, Gioia sought additional support at Morgan Stanley but faced challenges meeting production criteria for firm-sponsored assistance.</p><p><br></p><p>These strategic moves come as Wells Fargo bolsters its advisor recruitment efforts under new leadership. On April 1, they appointed Farhad Firoozi, formerly of LPL Financial, as the head of advisor recruiting.</p><p>The financial advisory industry continues to evolve, with firms like Morgan Stanley, JPMorgan Chase, and Wells Fargo constantly adjusting strategies to attract and retain top talent. As competition intensifies, the ability to offer comprehensive client services and career progression opportunities will be crucial in shaping the future landscape.</p>","author":"Admin User","category":"moves","tags":"[]","featuredImage":"https://iclg.com/uploads/pages/images/morgan-stanley-switzerland-hit-with-chf-1-million-fine_0_ZiXqKWqjnc5YkCySaMLuzwQPgvLYtqiDMpKco8az.jpg","published":true,"featured":false,"createdAt":"2025-05-07T09:45:18.751Z","updatedAt":"2025-05-07T09:45:18.751Z","imageUrl":"https://iclg.com/uploads/pages/images/morgan-stanley-switzerland-hit-with-chf-1-million-fine_0_ZiXqKWqjnc5YkCySaMLuzwQPgvLYtqiDMpKco8az.jpg","date":"2025-04-10T04:00:00.000Z"},{"id":28,"title":"Florida's Financial Landscape Shifts as Top Advisors Transition to NewEdge","slug":"floridas-financial-landscape-shifts-as-top-advisors-transition-to-newedge","excerpt":"NewEdge attracts a top $1.4B team from Merrill, reshaping Florida's financial advisory sector.","content":"<!--publishDate:2025-03-28T04:00:00.000Z-->\n<p>In a notable shift within the financial advisory landscape, NewEdge Advisors has successfully attracted a prominent team from Merrill Lynch, marking a significant move in Florida's investment advisory sector. This development, reported by a well-placed source, underscores the evolving dynamics in the industry as advisors seek more versatile platforms.</p><p>The team, originally known as Krueger, Fosdyck &amp; Associates at Merrill Lynch, managed an impressive $1.4 billion in assets. The group is spearheaded by seasoned financial advisors R. Tim Krueger, Cory J. Fosdyck, and Jerry S. Brown, who collectively generated over $8 million in annual revenue. Joining them are advisors Collin A. McCall, Nina C. McClanahan, and Gabe M. Campbell, with support from staff members Lindsey Peters, Jen Wendt, and Jack Mitchell.</p><p><br></p><p>In a video message addressing their clientele, Collin McCall emphasized their decision to join NewEdge was driven by the firm's innovative technology platform and the greater autonomy it offers. \"This partnership with NewEdge allows us to deliver enhanced solutions while maintaining the personalized care our clients value,\" McCall stated.</p><p>NewEdge Capital, the parent company of NewEdge Advisors, boasts a robust network of 450 professionals managing a total of $60 billion in assets. According to <a href=\"https://www.newedgecapital.com\" rel=\"noopener noreferrer\" target=\"_blank\">NewEdge's website</a>, the firm has been expanding rapidly, with recent office openings across Arkansas, Tennessee, and California.</p><p><br></p><p>The transition of this influential team from Merrill Lynch is notable, particularly given the background of the advisors involved. Krueger initiated his career at First Jersey Securities in 1983 before joining Merrill in 2006 after a stint at UBS. Fosdyck also began at UBS, entering Merrill in the same year. Brown's journey included First Investors Corp and a period at Morgan Stanley before rejoining Merrill in 2014. The other team members, McCall and McClanahan, began their careers with Merrill in 2012 and 2019, while Campbell brought his extensive experience from JPMorgan Chase &amp; Co. in 2018.</p><p><br></p><p>These transitions reflect a broader industry trend where advisors are increasingly evaluating the platforms that best support their client service models and personal career goals. As Merrill Lynch adapts to modern challenges, NewEdge's allure lies in its promise of innovative solutions and flexibility.</p><p><br></p><p>The move has not gone unnoticed in the industry, with discussions around the strategic decisions of financial advisors gaining momentum. As the financial landscape continues to evolve, such transitions are expected to shape the future of investment advisory services.</p>","author":"Admin User","category":"advisor-transitions","tags":"[\"NewEdge Advisors\",\"Merrill Lynch\"]","featuredImage":"https://images.unsplash.com/photo-1445699269025-bcc2c8f3faee?fm=jpg&q=60&w=3000&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OHx8YmxhY2slMjBhbmQlMjB3aGl0ZSUyMG5ldyUyMHlvcmt8ZW58MHx8MHx8fDA%3D","published":true,"featured":false,"createdAt":"2025-05-07T12:53:10.202Z","updatedAt":"2025-05-07T12:53:10.202Z","imageUrl":"https://images.unsplash.com/photo-1445699269025-bcc2c8f3faee?fm=jpg&q=60&w=3000&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OHx8YmxhY2slMjBhbmQlMjB3aGl0ZSUyMG5ldyUyMHlvcmt8ZW58MHx8MHx8fDA%3D","date":"2025-03-28T04:00:00.000Z"},{"id":29,"title":"Strategic Shifts: Ohio Brokers Transition to RIA Kingsview for Greater Flexibility","slug":"strategic-shifts-ohio-brokers-transition-to-ria-kingsview-for-greater-flexibility","excerpt":"Two Ohio brokers join Kingsview RIA for greater flexibility and growth opportunities.","content":"<!--publishDate:2025-02-28T05:00:00.000Z-->\n<p>Cory L. Hixson and Zach R. Boyd, two experienced brokers from Edward Jones, have taken a significant step in their careers by joining the registered investment advisor Kingsview Partners in Ohio. This move represents a strategic shift in the financial advisory landscape, highlighting the growing allure of RIAs for seasoned professionals.</p><p><br></p><p>With a combined management of $335 million in assets, Hixson and Boyd have opened a new office in Marysville. Although they are maintaining separate client lists for now, they are open to future collaboration, according to Hixson. Their departure from Edward Jones, where they spent 10 and 15 years respectively, marks a significant career milestone.</p><p><br></p><p>Hixson explained that his decision to leave was driven by a realization that he had \"outgrown\" Edward Jones. Known for its robust training programs for novice brokers, Edward Jones has been a commendable starting point for many, but its limitations in scaling and flexibility can become apparent over time.</p><p><br></p><p>\"It's a great place to start in the industry and grow your acumen, but scaling efficiently and finishing your career there is challenging,\" Hixson noted. The transition to Kingsview offers more autonomy, allowing the duo to explore options such as hiring junior advisors or acquiring outside practices—opportunities that would have been stunted by the restrictive environment at Edward Jones.</p><p><br></p><p>Meanwhile, Edward Jones has been evolving its business model to offer high-end products like separately managed accounts and has made strides in client relationship management. Recent initiatives include a partnership with U.S. Bank to provide credit cards and checking accounts, reflecting a broader strategy to enhance client offerings.</p><p><br></p><p>Kingsview Partners, founded in 2008 by former commodities trader Josh Lewis, has been aggressively expanding by attracting talent from established firms. The company, which boasts $7 billion in advisory assets, has successfully recruited teams across the United States, including recent acquisitions in Illinois and Texas. Kingsview's growth strategy is supported by partnerships with Charles Schwab &amp; Co., Raymond James Financial, and Interactive Brokers, offering equity stakes and recruiting bonuses to new advisors.</p><p><br></p><p>This trend underscores a significant shift in the advisory industry, where flexibility, growth potential, and the ability to innovate are increasingly valued by top talent. As the landscape continues to evolve, the move by Hixson and Boyd is a testament to the dynamic nature of the financial advisory world.</p>","author":"Admin User","category":"advisor-transitions","tags":"[\"Edward Jones\"]","featuredImage":"https://www.edwardjones.com/sites/default/files/acquiadam/2022-07/2015-06-seattle-branch-exp-092.jpg","published":true,"featured":false,"createdAt":"2025-05-07T12:56:14.802Z","updatedAt":"2025-05-07T12:56:14.802Z","imageUrl":"https://www.edwardjones.com/sites/default/files/acquiadam/2022-07/2015-06-seattle-branch-exp-092.jpg","date":"2025-02-28T05:00:00.000Z"},{"id":27,"title":"Wells Fargo's Strategic Recruitment: A Deeper Dive into the $2.4 Million Team Acquisition","slug":"wells-fargos-strategic-recruitment-a-deeper-dive-into-the-24-million-team-acquisition","excerpt":"Wells Fargo recruits a $2.4M team from Stifel, reshaping financial advisory dynamics.","content":"<!--publishDate:2025-02-26T05:00:00.000Z-->\n<p>In a strategic move that has sent ripples through the financial advisory industry, Wells Fargo has successfully recruited a high-performing team from Stifel Nicolaus &amp; Co. in New York City. This team, helmed by Adam G. Shafiroff and Laurence Shafiroff, has been a prolific force, generating $2.4 million in annual revenue. The transition also includes junior broker Max Scher and client associate Jennifer Urena, marking a significant reshuffle in the competitive landscape of wealth management.</p><p><br></p><h2>The Shafiroff Legacy: A Journey Through Financial Giants</h2><p>Adam G. Shafiroff brings with him a wealth of experience, having navigated the sectors of RBC Wealth Management-U.S. and Barclays before joining Stifel in 2019. His nephew, Laurence, started his career four decades ago at Merrill Lynch, navigating the tumultuous waters of the 2008 financial crisis through Lehman Brothers' acquisition by Barclays. Their combined experience and robust client portfolios make them a coveted prize in the financial advisory realm.</p><p><br></p><h2><br></h2><p>This move comes as part of a broader trend of talent acquisition in the industry, with firms like Wells Fargo ramping up efforts to secure top talent amidst a competitive market. Stifel, which saw a 2% decline in headcount last year, faces challenges in maintaining its workforce. The firm has historically maintained a conservative approach to recruitment, but recent departures suggest a potential reevaluation of their strategies.</p><h2><br></h2><p>The financial advisory sector is witnessing intensified competition, with firms like Morgan Stanley and Rockefeller Capital Management also making significant recruitment moves. Notably, Wells Fargo's aggressive recruitment tactics are reshaping industry dynamics, underscoring the importance of retaining top talent in an increasingly volatile market.</p><h2><br></h2><p>While the transition is a strategic win for Wells Fargo, opinions in the industry remain divided. John, a commenter on the transition, expressed skepticism about the benefits to clients and advisors, citing concerns over deferred compensation and contractual obligations. Meanwhile, others speculate the move is more about financial gains than strategic alignment, reflecting broader industry sentiments.</p><p><br></p><p>This recruitment signifies more than just a change in team alignment; it highlights the evolving strategies of financial firms in securing and leveraging top talent to navigate an ever-changing market landscape.</p>","author":"Admin User","category":"advisor-transitions","tags":"[\"Wells Fargo\",\"Stifel\"]","featuredImage":"https://unionrayo.com/en/wp-content/uploads/2025/04/wells-fargo-to-close-inactive-accounts-april.jpg","published":true,"featured":false,"createdAt":"2025-05-07T10:34:12.515Z","updatedAt":"2025-05-07T12:58:57.138Z","imageUrl":"https://unionrayo.com/en/wp-content/uploads/2025/04/wells-fargo-to-close-inactive-accounts-april.jpg","date":"2025-02-26T05:00:00.000Z"}]